
import random

def гра_орел_решка():
    варіанти = ['Орел', 'Решка']
    перемоги = 0
    while True:
        вибір_користувача = input("Виберіть 'Орел' або 'Решка': ").capitalize()
        if вибір_користувача in варіанти:
            результат = random.choice(варіанти)
            print("Випало:", результат)
            if вибір_користувача == результат:
                перемоги += 1
                print(f"Ви виграли! Ви виграли {перемоги} раз.")
            else:
                print("Ви програли.")
            break
        else:
            print("Будь ласка, введіть 'Орел' або 'Решка'.")


    меню()

def меню():
    print("\nМеню:")
    print("1. Старт")
    print("2. Вихід")
    вибір = input("Оберіть опцію: ")
    if вибір == '1':
        гра_орел_решка()
    elif вибір == '2':
        print("Гра завершена.")
    else:
        print("Невірний вибір. Будь ласка, спробуйте знову.")
        меню()


print("Ласкаво просимо до гри 'Орел або Решка'!")
меню()
